# Type advantages
Dragon -> Spellcaster -> Undead -> Beast -> Warrior -> Dragon

# Summon probability (3 dice):
Formula: (9 * n^2 + n^3) / 108, n=summon_crests
Level 1 (4 crests): 74%
Level 2 (3 crests): 50%
Level 3 (2 crests): 26%
Level 4 (1 crest ): 7.4%

# Summon probability (2 dice):
Formula: n^2 /36, n=summon_crests
Level 1 (4 crests): 44%
Level 2 (3 crests): 25%
Level 3 (2 crests): 5.6%
Level 4 (1 crest ): 2.8%

# Dice Dimensions (11 types):
  T1     T2     Z1     Z2     X1     X2   
🟦🟦🟦 🟦🟦   🟦🟦   🟦🟦     🟦     🟦   
  🟪     🟪🟦   🟪     🟪   🟦🟪🟦 🟦🟪   
  🟦     🟦     🟦     🟦🟦   🟦     🟦🟦 
  🟦     🟦     🟦🟦   🟦     🟦     🟦   

  M1   M2     S1     S2     L1
🟦🟦   🟦     🟦     🟦     🟦
  🟪   🟦🟪   🟦🟪🟦 🟦🟪   🟦
  🟦🟦   🟦🟦   🟦     🟦🟦 🟪🟦
    🟦     🟦   🟦     🟦     🟦
                              🟦
# Dungeon
Double-width 19x13
    a b c d e f g h i j k l m n o p q r s
  🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲
 1🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲1
 2🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲2
 3🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲3
 4🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲4
 5🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲5
 6🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲6
 7🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲7
 8🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲8
 9🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲9
10🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲10
11🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲11
12🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲12
13🔲⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛🔲13
  🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲🔲
     a b c d e f g h i j k l m n o p q r s
